TOKEN ="7790919054:AAHFh0DVGr62ZuOzf6nOYjtL3kxDCPwIf1c"

questions = [
    {
        "question": "Какое ваше любимое время суток?",
        "options": ["Утро", "День", "Вечер", "Ночь"]
    },
    {
        "question": "Какое ваше любимое время года?",
        "options": ["Зима", "Весна", "Лето", "Осень"]
    },
    {
        "question": "Что вам больше нравится?",
        "options": ["Прогулки", "Еда", "Игры", "Отдых"]
    },
    {
        "question": "Выберите свою стихию:",
        "options": ["Огонь", "Вода", "Земля", "Воздух"]
    },
    {
        "question": "Что вам ближе всего?",
        "options": ["Приключения", "Стабильность", "Забота", "Свобода"]
    }
]

# Ассоциации ответов с животными
animal_mapping = {
    "Утро": "Слон",
    "День": "Тигр",
    "Вечер": "Енот",
    "Ночь": "Капибара",
    "Зима": "Слон",
    "Весна": "Тигр",
    "Лето": "Енот",
    "Осень": "Капибара",
    "Прогулки": "Слон",
    "Еда": "Капибара",
    "Игры": "Енот",
    "Отдых": "Тигр",
    "Огонь": "Тигр",
    "Вода": "Капибара",
    "Земля": "Слон",
    "Воздух": "Енот",
    "Приключения": "Енот",
    "Стабильность": "Слон",
    "Забота": "Капибара",
    "Свобода": "Тигр"
}



image_folder = r"C:\Users\zaxar\projects\Skillfactory\zoobot\img"


animal_images = {
    "Слон": "elephant.jpg",
    "Тигр": "tiger.jpg",
    "Енот": "enot.jpg",
    "Капибара": "capybara.jpg"
}
